# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
#np.random.randint(lowest integer, highest integer, size=number of random integers)

n1 = np.random.randint(1,5,100)

n2 = np.random.randint(1,4,100)

n3 = np.random.randint(10000, 30000,100)

In [3]:
s1 = pd.Series(n1,range(1,101))

s1

1      2
2      3
3      3
4      3
5      1
      ..
96     2
97     4
98     3
99     2
100    2
Length: 100, dtype: int32

In [4]:
s2 = pd.Series(n2,range(1,101))

s2

1      3
2      3
3      3
4      2
5      3
      ..
96     3
97     2
98     1
99     3
100    3
Length: 100, dtype: int32

In [5]:
s3 = pd.Series(n3,range(1,101))
s3

1      10955
2      20392
3      18720
4      21235
5      24632
       ...
96     16468
97     26342
98     16920
99     19026
100    18127
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [6]:
# create a df 

df = pd.concat([s1,s2,s3], axis=1)

df

     0  1      2
1    2  3  10955
2    3  3  20392
3    3  3  18720
4    3  2  21235
5    1  3  24632
..  .. ..    ...
96   2  3  16468
97   4  2  26342
98   3  1  16920
99   2  3  19026
100  2  3  18127

[100 rows x 3 columns]

In [7]:
# append() - concatenates along axis=0 i.e. rows

# pd.DataFrame(s1.append([s2,s3]))

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 1 to 100
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       100 non-null    int32
 1   1       100 non-null    int32
 2   2       100 non-null    int32
dtypes: int32(3)
memory usage: 1.3 KB

In [9]:
list(df.columns)

[0, 1, 2]

In [12]:
# here original cols are not str, so dont use ''

df.rename(columns={0: 'bedrs', 1:'bathrs', 2: 'price_sqr_meter'}, inplace=True)

df

     bedrs  bathrs  price_sqr_meter
1        2       3            10955
2        3       3            20392
3        3       3            18720
4        3       2            21235
5        1       3            24632
..     ...     ...              ...
96       2       3            16468
97       4       2            26342
98       3       1            16920
99       2       3            19026
100      2       3            18127

[100 rows x 3 columns]

In [13]:
list(df.columns)

['bedrs', 'bathrs', 'price_sqr_meter']

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [19]:
bigcolumn = pd.DataFrame(s1.append([s2,s3]))

print(type(bigcolumn))

<class 'pandas.core.frame.DataFrame'>

In [23]:
bigcolumn

         0
1        2
2        3
3        3
4        3
5        1
..     ...
96   16468
97   26342
98   16920
99   19026
100  18127

[300 rows x 1 columns]

In [26]:
bigcolumn1 = pd.concat([s1, s2, s3], axis=0)

print(type(bigcolumn1))          # its a series, so have to convert to df

<class 'pandas.core.series.Series'>

In [27]:
bigcolumn1= pd.DataFrame(bigcolumn1)

In [28]:
bigcolumn1

         0
1        2
2        3
3        3
4        3
5        1
..     ...
96   16468
97   26342
98   16920
99   19026
100  18127

[300 rows x 1 columns]

In [29]:
print(type(bigcolumn1))          # converted to df

<class 'pandas.core.frame.DataFrame'>

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [30]:
bigcolumn.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
             91,  92,  93,  94,  95,  96,  97,  98,  99, 100],
           dtype='int64', length=300)

In [32]:
list(bigcolumn.index)

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100]

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [38]:
# Reindexing used to change the index of rows and columns of a df

bigcolumn = bigcolumn.reset_index(drop = True)

bigcolumn

         0
0        2
1        3
2        3
3        3
4        1
..     ...
295  16468
296  26342
297  16920
298  19026
299  18127

[300 rows x 1 columns]